# 4.6 Merging and exporting data - Task

This script contains the following points:

1. Import dataframe
2. Combine the orders_products_combined dataframe with your products data set
3. Results-the merge flag
4. Export the new dataframe

1. Import dataframe

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Import dataframes ords and ords_prior

path=r'C:\Users\olilo\OneDrive\Dokumente\CF\Data Analytics Immersion_Week 8-9\2023-08-28 Instacart Basket Analysis'

df_ords_prod = pd.read_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))
df_prod = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

In [3]:
# Check the dataframe

df_ords_prod.shape

(32434489, 12)

In [4]:
df_ords_prod.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,prior,1,2,8,NaN,196,1,0,both
1,0,2539329,1,prior,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,prior,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,prior,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,prior,1,2,8,NaN,26405,5,0,both

In [5]:
# Columns that are unusable are removed from the dataframe

df_ords_prod = df_ords_prod.drop(columns = ['Unnamed: 0', '_merge'])

In [6]:
# Output chack

df_ords_prod.shape

(32434489, 10)

In [7]:
# Check the dataframe prod

df_prod.shape

(49672, 6)

In [8]:
df_prod.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [9]:
# Columns that are unusable are removed from the dataframe

df_prod = df_prod.drop(columns = ['Unnamed: 0'])

In [10]:
# Output chack

df_prod.shape

(49672, 5)

2. Combine the orders_products_combined dataframe with your products data set

Key: product_id

Same column in both dataframes

In [11]:
# Create a new dataframe df_ords_prods_merged

df_ords_prods_merged = df_ords_prod.merge(df_prod, on = 'product_id', indicator = True)

In [12]:
# Output check

df_ords_prods_merged.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,prior,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,prior,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,prior,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,prior,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,prior,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [13]:
df_ords_prods_merged.shape

(32404859, 15)

3. Results-the merge flag

In [14]:
# Merge flag frequency check 

df_ords_prods_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

The number of all rows in new dataframe:32.404.859  
Naumber of rows have change.

In [15]:
# Create a new dataframe df_ords_prods_merged with how argument

df_ords_prods_merged_out = df_ords_prod.merge(df_prod, on = 'product_id', how = 'outer',indicator=True)

In [16]:
# Output check

df_ords_prods_merged_out.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329.0,1.0,prior,1.0,2.0,8.0,NaN,196,1.0,0.0,Soda,77.0,7.0,9.0,both
1,2398795.0,1.0,prior,2.0,3.0,7.0,15.0,196,1.0,1.0,Soda,77.0,7.0,9.0,both
2,473747.0,1.0,prior,3.0,3.0,12.0,21.0,196,1.0,1.0,Soda,77.0,7.0,9.0,both
3,2254736.0,1.0,prior,4.0,4.0,7.0,29.0,196,1.0,1.0,Soda,77.0,7.0,9.0,both
4,431534.0,1.0,prior,5.0,4.0,15.0,28.0,196,1.0,1.0,Soda,77.0,7.0,9.0,both

In [17]:
df_ords_prods_merged_out.shape

(32435070, 15)

In [18]:
# Merge flag frequency check 

df_ords_prods_merged_out['_merge'].value_counts()

_merge
both          32404859
left_only        30200
right_only          11
Name: count, dtype: int64

Secand dataframe with merge how function, outer.

The number of all rows in both df :32.404.859

By re-checking, we can see how much data we're losing through the call to the standard function a outer. 
Used to keep all information from both dataframes = lot of missing data in final dataframe
(left_only: 30200, right_only: 11)

4. Export the new dataframe

In [19]:
# Export the new dataframe 

df_ords_prods_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))